---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.LegendFailures
source: html/760fc459-4777-b621-44ac-ee2f48fe1d81.htm
---
# BuiltInFailures.LegendFailures Properties

Legend Components may only be placed in Legends